Revit 2024 API
BuiltInFailures.FormFailures.OpenProfileMultiSegmentSweepsNotSupported Property
 An open profile cannot be swept along a multi-segment path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OpenProfileMultiSegmentSweepsNotSupported { get; }
Visual Basic
Public Shared ReadOnly Property OpenProfileMultiSegmentSweepsNotSupported As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OpenProfileMultiSegmentSweepsNotSupported {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FormFailures Class
Autodesk.Revit.DB Namespace